## CREATE CONNECTION

In [1]:
#mysql connector for creating connection
import mysql.connector

In [2]:

# Connecting from the server
database = mysql.connector.connect(user = 'root',
                               host = 'localhost',
                              passwd = 'Tharif786')

## Create Cursor Object

In [3]:

# Preparing a cursor object
cursor_object = database.cursor()

## Check For Databases

In [4]:
#check for databases
cursor_object.execute("SHOW DATABASES")

#retrive all rows 
databases = cursor_object.fetchall()

#printing all database names
for database_name in databases:
    print(database_name)

('companydatabase',)
('information_schema',)
('library_management_system',)
('mysql',)
('performance_schema',)
('sys',)
('testdb',)

# DATA DEFINITION LANGUAGE

#### Creating Databases

In [57]:
#creating a Database
cursor_object.execute("CREATE DATABASE CompanyDatabase")

cursor_object.execute("SHOW DATABASES")

databases = cursor_object.fetchall()

for database_name in databases:
    print(database_name)

('companydatabase',)
('information_schema',)
('library_management_system',)
('mysql',)
('performance_schema',)
('sys',)
('testdb',)

#### Creating tables and defining Schema with Constraints

In [5]:
cursor_object.execute("USE CompanyDatabase")

In [64]:
cursor_object.execute(  """CREATE TABLE Employees ( 
                                                    EmployeeID INT PRIMARY KEY ,
                                                    FirstNAME VARCHAR(50) NOT NULL,
                                                    LastName VARCHAR(50),
                                                    DepartmentID INT NOT NULL,
                                                    HireDate DATE,
                                                    Salary Decimal(10,2) NOT NULL,
                                                    ActiveStatus BOOLEAN DEFAULT TRUE
                                                  )"""
                     )

In [65]:
cursor_object.execute( """ CREATE TABLE Departments (
                                                        DepartmentID INT PRIMARY KEY,
                                                        DepartmentName VARCHAR(50) UNIQUE  
                                                    )"""
    
                      )

In [66]:
cursor_object.execute( """  CREATE TABLE Projects ( 
                                                    ProjectID INT PRIMARY KEY,
                                                    ProjectName VARCHAR(50) NOT NULL ,
                                                    StartDate DATE NOT NULL,
                                                    EndDate DATE DEFAULT NULL,
                                                    Status VARCHAR(20) DEFAULT 'ONGOING'
                                                    )""" 
                        )

In [67]:
cursor_object.execute( """ CREATE TABLE EmployeeProjects (
                                                        EmployeeID INT REFERENCES Employees(EmployeeID),
                                                        ProjectID INT REFERENCES Projects(ProjectID),
                                                        Role VARCHAR(50)
                                                        )"""       
                     )

In [68]:
cursor_object.execute("SHOW TABLES")

tables = cursor_object.fetchall()

for table_name in tables:
    print(table_name)

('departments',)
('employeeprojects',)
('employees',)
('projects',)

In [94]:
#describing table
cursor_object.execute("desc departments")

#cursor_object.execute("desc Employees")
table_description = cursor_object.fetchall()

# Print the column names 
for column_name in table_description:
    print(column_name[0])

DepartmentID
DepartmentName

In [91]:
database.commit()

#### Alter table and renaming

In [95]:
#adding column in the table
cursor_object.execute("ALTER TABLE Employees ADD COLUMN EMAIL VARCHAR(50) ")

In [8]:
cursor_object.execute("desc Employees")

table_description = cursor_object.fetchall()

# Print the column names 
for column_name in table_description:
    print(column_name[0])

EmployeeID
FirstName
LastName
DepartmentID
HireDate
Salary
ActiveStatus
EMAIL

In [10]:
#RENAMING THE COLUMN
cursor_object.execute("ALTER TABLE Employees RENAME COLUMN FirstNAME TO FirstName ")

EmployeeID
FirstName
LastName
DepartmentID
HireDate
Salary
ActiveStatus
EMAIL

In [12]:
#MODIFYING THE DATA TYPE OF A COLUMN
cursor_object.execute("ALTER TABLE Employees MODIFY EMAIL VARCHAR(60) ")


cursor_object.execute("desc Employees")
table_description = cursor_object.fetchall()

# Print the column names 
for column_name in table_description:
    print(column_name)

('EmployeeID', 'int', 'NO', 'PRI', None, '')
('FirstName', 'varchar(50)', 'NO', '', None, '')
('LastName', 'varchar(50)', 'YES', '', None, '')
('DepartmentID', 'int', 'NO', '', None, '')
('HireDate', 'date', 'YES', '', None, '')
('Salary', 'decimal(10,2)', 'NO', '', None, '')
('ActiveStatus', 'tinyint(1)', 'YES', '', '1', '')
('EMAIL', 'varchar(60)', 'YES', '', None, '')

In [13]:
database.commit()

# DATA MANIPULATION LANGUAGE

## INSERT

#### Departments Table

In [19]:
cursor_object.execute("INSERT INTO Departments VALUES(101,'IT')")

In [20]:
cursor_object.execute("INSERT INTO Departments VALUES(102,'HR')")

In [21]:
cursor_object.execute("INSERT INTO Departments VALUES(103,'Finance')")

In [22]:
cursor_object.execute("INSERT INTO Departments VALUES(104,'Technical')")

In [23]:
cursor_object.execute("INSERT INTO Departments VALUES(105,'Marketing')")

In [11]:
cursor_object.execute("SELECT * FROM DEPARTMENTS")

rows = cursor_object.fetchall()

for attributes in rows:
    print(attributes)

(103, 'Finance')
(102, 'HR')
(101, 'IT')
(105, 'Marketing')
(104, 'Technical')

#### EmployeeProject Table

In [15]:
id=[1,2,3,4,5]
pid=[201,202,203,204,205]
Role=['Manager','Developer','Tester','Analyst','Consultant']

for i in range(0,len(pid)):
    cursor_object.execute(f"INSERT INTO EmployeeProjects VALUES({id[i]},{pid[i]},'{Role[i]}')")

In [14]:
cursor_object.execute("SELECT * FROM EmployeeProjects")

rows = cursor_object.fetchall()

for attributes in rows:
    print(attributes)

(1, 201, 'Manager')
(2, 202, 'Developer')
(3, 203, 'Tester')
(4, 204, 'Analyst')
(5, 205, 'Consultant')

#### Employees Table

In [11]:
cursor_object.execute("DESC Employees")

rows = cursor_object.fetchall()

for attributes in rows:
    print(attributes)

('EmployeeID', 'int', 'NO', 'PRI', None, '')
('FirstName', 'varchar(50)', 'NO', '', None, '')
('LastName', 'varchar(50)', 'YES', '', None, '')
('DepartmentID', 'int', 'NO', '', None, '')
('HireDate', 'date', 'YES', '', None, '')
('Salary', 'decimal(10,2)', 'NO', '', None, '')
('ActiveStatus', 'tinyint(1)', 'YES', '', '1', '')
('EMAIL', 'varchar(60)', 'YES', '', None, '')

In [12]:
cursor_object.execute("""INSERT INTO Employees(EmployeeID,FirstName, LastName ,Email,DepartmentID,HireDate,Salary,ActiveStatus) VALUES
                        (1, 'John', 'Doe', 'john.doe@example.com', 101, '2020-05-01', 50000.00, TRUE),
                        (2, 'Jane', 'Smith', 'jane.smith@example.com', 102, '2021-07-15', 60000.00, TRUE),
                        (3, 'Mike', 'Brown', 'mike.brown@example.com', 101, '2022-01-10', 55000.00, TRUE),
                        (4, 'Emily', 'White', 'emily.white@example.com', 103, '2021-12-05', 62000.00, FALSE),
                        (5, 'David', 'Black', 'david.black@example.com', 102, '2019-03-20', 70000.00, TRUE);
                     """)

In [13]:
cursor_object.execute("SELECT * FROM Employees")

rows = cursor_object.fetchall()

for attributes in rows:
    print(attributes)

(1, 'John', 'Doe', 101, datetime.date(2020, 5, 1), Decimal('50000.00'), 1, 'john.doe@example.com')
(2, 'Jane', 'Smith', 102, datetime.date(2021, 7, 15), Decimal('60000.00'), 1, 'jane.smith@example.com')
(3, 'Mike', 'Brown', 101, datetime.date(2022, 1, 10), Decimal('55000.00'), 1, 'mike.brown@example.com')
(4, 'Emily', 'White', 103, datetime.date(2021, 12, 5), Decimal('62000.00'), 0, 'emily.white@example.com')
(5, 'David', 'Black', 102, datetime.date(2019, 3, 20), Decimal('70000.00'), 1, 'david.black@example.com')

#### Projects Table

In [15]:
cursor_object.execute("""INSERT INTO Projects VALUES
                        (201, 'Alpha', '2023-01-01', '2023-12-31', 'Ongoing'),
                        (202, 'Beta', '2022-05-01', NULL, 'Ongoing'),
                        (203, 'Gamma', '2021-03-15', '2022-10-30', 'Completed'),
                        (204, 'Delta', '2023-07-01', NULL, 'Ongoing'),
                        (205,'Nova','2023-08-15',NULL,'Ongoing');
                        """)

In [16]:
cursor_object.execute("SELECT * FROM Projects")

rows = cursor_object.fetchall()

for attributes in rows:
    print(attributes)

(201, 'Alpha', datetime.date(2023, 1, 1), datetime.date(2023, 12, 31), 'Ongoing')
(202, 'Beta', datetime.date(2022, 5, 1), None, 'Ongoing')
(203, 'Gamma', datetime.date(2021, 3, 15), datetime.date(2022, 10, 30), 'Completed')
(204, 'Delta', datetime.date(2023, 7, 1), None, 'Ongoing')
(205, 'Nova', datetime.date(2023, 8, 15), None, 'Ongoing')

## UPDATE

In [27]:
# Update record in the Projects table
query = "UPDATE Projects SET EndDate = %s,Status=%s WHERE ProjectName = %s"
values = ('2024-09-15', 'Completed','Nova')
cursor_object.execute(query, values)

In [28]:
cursor_object.execute("SELECT * FROM Projects")

rows = cursor_object.fetchall()

for attributes in rows:
    print(attributes)

(201, 'Alpha', datetime.date(2023, 1, 1), datetime.date(2023, 12, 31), 'Ongoing')
(202, 'Beta', datetime.date(2022, 5, 1), None, 'Ongoing')
(203, 'Gamma', datetime.date(2021, 3, 15), datetime.date(2022, 10, 30), 'Completed')
(204, 'Delta', datetime.date(2023, 7, 1), None, 'Ongoing')
(205, 'Nova', datetime.date(2023, 8, 15), datetime.date(2024, 9, 15), 'Completed')

## DELETE

In [38]:
cursor_object.execute("INSERT INTO Departments VALUES(108,'computer')")

In [39]:
cursor_object.execute("SELECT * FROM Departments ")

rows = cursor_object.fetchall()

for attributes in rows:
    print(attributes)

(108, 'computer')
(103, 'Finance')
(102, 'HR')
(101, 'IT')
(105, 'Marketing')
(104, 'Technical')

In [40]:
cursor_object.execute("DELETE FROM Departments WHERE DepartmentID = 108")

In [41]:
cursor_object.execute("SELECT * FROM Departments ")

rows = cursor_object.fetchall()

for attributes in rows:
    print(attributes)

(103, 'Finance')
(102, 'HR')
(101, 'IT')
(105, 'Marketing')
(104, 'Technical')

## TRUNCATE

In [42]:
#cursor_object.execute("TRUNCATE Departments")

In [43]:
#cursor_object.execute("DROP Departments")

In [44]:
database.commit()

# Transaction Control Statements

## Rollback and Savepoint

In [71]:
cursor_object.execute("SAVEPOINT savepoint_1")

In [72]:
cursor_object.execute("SELECT * FROM Departments ")

rows = cursor_object.fetchall()

for attributes in rows:
    print(attributes)

(103, 'Finance')
(102, 'HR')
(101, 'IT')
(105, 'Marketing')
(104, 'Technical')

In [73]:
cursor_object.execute("INSERT INTO Departments (DepartmentID, DepartmentName) VALUES (108, 'Operations')")

In [74]:
cursor_object.execute("SELECT * FROM Departments ")

rows = cursor_object.fetchall()

for attributes in rows:
    print(attributes)

(103, 'Finance')
(102, 'HR')
(101, 'IT')
(105, 'Marketing')
(108, 'Operations')
(104, 'Technical')

In [75]:
database.rollback()

In [76]:
cursor_object.execute("SELECT * FROM Departments ")

rows = cursor_object.fetchall()

for attributes in rows:
    print(attributes)

(103, 'Finance')
(102, 'HR')
(101, 'IT')
(105, 'Marketing')
(104, 'Technical')

In [77]:
database.commit()